t21/Walnut_X/Packages/.cache/Keil.EZR32HG_DFP.1.0.0.pdsc
        <!-- *************************  Device 'EZR32HG220F64R60'  ***************************** -->
        <device Dname="EZR32HG220F64R60">
          <compile header="Device/EZR32HG/Include/em_device.h"  define="EZR32HG220F64R60"/>
          <debug svd="SVD/EZR32HG/EZR32HG220F64R60.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00010000" startup="1"   default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00002000" init   ="0"   default="1"/>
          <algorithm name="Flash/EFM32M0P.FLM" start="0x00000000" size="0x00010000"               default="1"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EZR32HG220 R61'  **************************** -->
      <subFamily DsubFamily="EZR32HG220 R61">
        <!--book name="Documents/EZR32HG108FXX_DataSheet.pdf" title="EZR32HG220 Data Sheet"/-->

        <!-- *************************  Device 'EZR32HG220F32R61'  ***************************** -->
        <device Dname="EZR32HG220F32R61">
          <compile header="Device/EZR32HG/Include/em_device.h"  define="EZR32HG220F32R61"/>
          <debug svd="SVD/EZR32HG/EZR32HG220F32R61.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32M0P.FLM" start="0x00000000" size="0x00008000"             default="1"/>
        </device>

        <!-- *************************  Device 'EZR32HG220F64R61'  ***************************** -->
        <device Dname="EZR32HG220F64R61">
          <compile header="Device/EZR32HG/Include/em_device.h"  define="EZR32HG220F64R61"/>
          <debug svd="SVD/EZR32HG/EZR32HG220F64R61.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00010000" startup="1"   default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00002000" init   ="0"   default="1"/>
          <algorithm name="Flash/EFM32M0P.FLM" start="0x00000000" size="0x00010000"               default="1"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EZR32HG220 R63'  **************************** -->
      <subFamily DsubFamily="EZR32HG220 R63">
        <!--book name="Documents/EZR32HG108FXX_DataSheet.pdf" title="EZR32HG220 Data Sheet"/-->

        <!-- *************************  Device 'EZR32HG220F32R63'  ***************************** -->
        <device Dname="EZR32HG220F32R63">
          <compile header="Device/EZR32HG/Include/em_device.h"  define="EZR32HG220F32R63"/>
          <debug svd="SVD/EZR32HG/EZR32HG220F32R63.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32M0P.FLM" start="0x00000000" size="0x00008000"             default="1"/>
        </device>

        <!-- *************************  Device 'EZR32HG220F64R63'  ***************************** -->
        <device Dname="EZR32HG220F64R63">
          <compile header="Device/EZR32HG/Include/em_device.h"  define="EZR32HG220F64R63"/>
          <debug svd="SVD/EZR32HG/EZR32HG220F64R63.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00010000" startup="1"   default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00002000" init   ="0"   default="1"/>
          <algorithm name="Flash/EFM32M0P.FLM" start="0x00000000" size="0x00010000"               default="1"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EZR32HG220 R67'  **************************** -->
      <subFamily DsubFamily="EZR32HG220 R67">
        <!--book name="Documents/EZR32HG108FXX_DataSheet.pdf" title="EZR32HG220 Data Sheet"/-->

        <!-- *************************  Device 'EZR32HG220F32R67'  ***************************** -->
        <device Dname="EZR32HG220F32R67">
          <compile header="Device/EZR32HG/Include/em_device.h"  define="EZR32HG220F32R67"/>
          <debug svd="SVD/EZR32HG/EZR32HG220F32R67.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32M0P.FLM" start="0x00000000" size="0x00008000"             default="1"/>
        </device>

        <!-- *************************  Device 'EZR32HG220F64R67'  ***************************** -->
        <device Dname="EZR32HG220F64R67">
          <compile header="Device/EZR32HG/Include/em_device.h"  define="EZR32HG220F64R67"/>
          <debug svd="SVD/EZR32HG/EZR32HG220F64R67.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00010000" startup="1"   default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00002000" init   ="0"   default="1"/>
          <algorithm name="Flash/EFM32M0P.FLM" start="0x00000000" size="0x00010000"               default="1"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EZR32HG220 R68'  **************************** -->
      <subFamily DsubFamily="EZR32HG220 R68">
        <!--book name="Documents/EZR32HG108FXX_DataSheet.pdf" title="EZR32HG220 Data Sheet"/-->

        <!-- *************************  Device 'EZR32HG220F32R68'  ***************************** -->
        <device Dname="EZR32HG220F32R68">
          <compile header="Device/EZR32HG/Include/em_device.h"  define="EZR32HG220F32R68"/>
          <debug svd="SVD/EZR32HG/EZR32HG220F32R68.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32M0P.FLM" start="0x00000000" size="0x00008000"             default="1"/>
        </device>

        <!-- *************************  Device 'EZR32HG220F64R68'  ***************************** -->
        <device Dname="EZR32HG220F64R68">
          <compile header="Device/EZR32HG/Include/em_device.h"  define="EZR32HG220F64R68"/>
          <debug svd="SVD/EZR32HG/EZR32HG220F64R68.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00010000" startup="1"   default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00002000" init   ="0"   default="1"/>
          <algorithm name="Flash/EFM32M0P.FLM" start="0x00000000" size="0x00010000"               default="1"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EZR32HG220 R69'  **************************** -->
      <subFamily DsubFamily="EZR32HG220 R69">
        <!--book name="Documents/EZR32HG108FXX_DataSheet.pdf" title="EZR32HG220 Data Sheet"/-->

        <!-- *************************  Device 'EZR32HG220F32R69'  ***************************** -->
        <device Dname="EZR32HG220F32R69">
          <compile header="Device/EZR32HG/Include/em_device.h"  define="EZR32HG220F32R69"/>
          <debug svd="SVD/EZR32HG/EZR32HG220F32R69.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32M0P.FLM" start="0x00000000" size="0x00008000"             default="1"/>
        </device>

        <!-- *************************  Device 'EZR32HG220F64R69'  ***************************** -->
        <device Dname="EZR32HG220F64R69">
          <compile header="Device/EZR32HG/Include/em_device.h"  define="EZR32HG220F64R69"/>
          <debug svd="SVD/EZR32HG/EZR32HG220F64R69.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00010000" startup="1"   default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00002000" init   ="0"   default="1"/>
          <algorithm name="Flash/EFM32M0P.FLM" start="0x00000000" size="0x00010000"               default="1"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EZR32HG320 R55'  **************************** -->
      <subFamily DsubFamily="EZR32HG320 R55">
        <!--book name="Documents/EZR32HG320FXX_DataSheet.pdf" title="EZR32HG320 Data Sheet"/-->

