t21/Walnut_X/Packages/.cache/Keil.EZR32HG_DFP.1.0.0.pdsc
        <!-- *************************  Device 'EZR32HG320F64R63'  ***************************** -->
        <device Dname="EZR32HG320F64R63">
          <compile header="Device/EZR32HG/Include/em_device.h"  define="EZR32HG320F64R63"/>
          <debug svd="SVD/EZR32HG/EZR32HG320F64R63.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00010000" startup="1"   default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00002000" init   ="0"   default="1"/>
          <algorithm name="Flash/EFM32M0P.FLM" start="0x00000000" size="0x00010000"               default="1"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EZR32HG320 R67'  **************************** -->
      <subFamily DsubFamily="EZR32HG320 R67">
        <!--book name="Documents/EZR32HG320FXX_DataSheet.pdf" title="EZR32HG320 Data Sheet"/-->

        <!-- *************************  Device 'EZR32HG320F32R67'  ***************************** -->
        <device Dname="EZR32HG320F32R67">
          <compile header="Device/EZR32HG/Include/em_device.h"  define="EZR32HG320F32R67"/>
          <debug svd="SVD/EZR32HG/EZR32HG320F32R67.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32M0P.FLM" start="0x00000000" size="0x00008000"             default="1"/>
        </device>

        <!-- *************************  Device 'EZR32HG320F64R67'  ***************************** -->
        <device Dname="EZR32HG320F64R67">
          <compile header="Device/EZR32HG/Include/em_device.h"  define="EZR32HG320F64R67"/>
          <debug svd="SVD/EZR32HG/EZR32HG320F64R67.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00010000" startup="1"   default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00002000" init   ="0"   default="1"/>
          <algorithm name="Flash/EFM32M0P.FLM" start="0x00000000" size="0x00010000"               default="1"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EZR32HG320 R68'  **************************** -->
      <subFamily DsubFamily="EZR32HG320 R68">
        <!--book name="Documents/EZR32HG320FXX_DataSheet.pdf" title="EZR32HG320 Data Sheet"/-->

        <!-- *************************  Device 'EZR32HG320F32R68'  ***************************** -->
        <device Dname="EZR32HG320F32R68">
          <compile header="Device/EZR32HG/Include/em_device.h"  define="EZR32HG320F32R68"/>
          <debug svd="SVD/EZR32HG/EZR32HG320F32R68.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32M0P.FLM" start="0x00000000" size="0x00008000"             default="1"/>
        </device>

        <!-- *************************  Device 'EZR32HG320F64R68'  ***************************** -->
        <device Dname="EZR32HG320F64R68">
          <compile header="Device/EZR32HG/Include/em_device.h"  define="EZR32HG320F64R68"/>
          <debug svd="SVD/EZR32HG/EZR32HG320F64R68.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00010000" startup="1"   default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00002000" init   ="0"   default="1"/>
          <algorithm name="Flash/EFM32M0P.FLM" start="0x00000000" size="0x00010000"               default="1"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EZR32HG220 R69'  **************************** -->
      <subFamily DsubFamily="EZR32HG320 R69">
        <!--book name="Documents/EZR32HG320FXX_DataSheet.pdf" title="EZR32HG320 Data Sheet"/-->

        <!-- *************************  Device 'EZR32HG320F32R69'  ***************************** -->
        <device Dname="EZR32HG320F32R69">
          <compile header="Device/EZR32HG/Include/em_device.h"  define="EZR32HG320F32R69"/>
          <debug svd="SVD/EZR32HG/EZR32HG320F32R69.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32M0P.FLM" start="0x00000000" size="0x00008000"             default="1"/>
        </device>

        <!-- *************************  Device 'EZR32HG320F64R69'  ***************************** -->
        <device Dname="EZR32HG320F64R69">
          <compile header="Device/EZR32HG/Include/em_device.h"  define="EZR32HG320F64R69"/>
          <debug svd="SVD/EZR32HG/EZR32HG320F64R69.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00010000" startup="1"   default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00002000" init   ="0"   default="1"/>
          <algorithm name="Flash/EFM32M0P.FLM" start="0x00000000" size="0x00010000"               default="1"/>
        </device>
      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="Compiler GCC">
      <require Tcompiler="GCC"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="EZR32HG">
      <description>Silicon Labs EZR32HG devices</description>
      <require Dvendor="Silicon Labs:21" Dname="EZR32HG*"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="EZR32HG CMSIS">
      <description>Silicon Labs EZR32HG devices and CMSIS-CORE</description>
      <require condition="EZR32HG"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <!-- emlib Conditions -->
    <condition id="emlib Framework">
      <description>Silicon Labs emlib Framework</description>
      <require condition="EZR32HG"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="Framework"/>
    </condition>
    <condition id="emlib SYSTEM">
      <description>Silicon Labs emlib with SYSTEM</description>
      <require condition="EZR32HG"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="Framework"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="SYSTEM"/>
    </condition>
